# read design 
read_verilog Mul.sv

# elaborate design hierarchy
hierarchy -check -top Mul

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

extract_fa

# mapping logic to gates.
abc -g gates,MUX,NMUX,AOI3,OAI3

# cleanup
clean -purge

# write synthesized design
write_json circuit.json

stat

#check output circuit
#show
