# read design 
read_verilog verilog/c2670.v

# elaborate design hierarchy
hierarchy -check -top c2670

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping logic to gates.
abc -g gates,MUX,NMUX,AOI3,OAI3

# Extract Full/Half Adder. Order is important.
# Changed order to avoid NOT gates are synthesized into FA
extract_fa

# cleanup
clean -purge

# write synthesized design
write_json circuit.json

# Print statistics
stat

#check output circuit
#show
