# read design 
read_verilog Control.sv

# elaborate design hierarchy
hierarchy -check -top Control

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

dffunmap

# mapping logic to gates.
abc -g gates
# abc -lut 16:16

# cleanup
clean -purge

# write synthesized design
write_json circuit.json

#check output circuit
# show
