# read design 
read_verilog ./aes-verilog/encrypt/*.v

# elaborate design hierarchy
hierarchy -check -top aes_1cc_fixed

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; flatten; opt

# mapping logic to gates.
abc -g gates,MUX,NMUX,AOI3,OAI3

# Extract Full/Half Adder. Order is important.
extract_fa

# cleanup
clean -purge

# write synthesized design
write_json circuit.json

# Print statistics
stat

#check output circuit
#show
